Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh686-v3.tmx
Source language: bo
Languages: en

source: །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་ཐུགས་རྗེ་ཆེན་པོ་ལ་ཕྱག་འཚལ་ལོ། །འདི་ལྟ་སྟེ། ཨོཾ་པདྨ་པཱ་ཎི།
en: Homage to the noble bodhisattva Avalokiteśvara, the great compassionate being! [

source: ཙ་ར་ཙ་ར་པདྨ་བྷུ་ཛེ།
en: 201] “Oṁ, Padmapāṇi!

source: ཛྭ་ལ་ཛྭ་ལ་ཧཱུ་ཏཱ་ཤ་ནེ།
en: Hold, hold, O lotus-armed one!

source: བྷུ་རུ་བྷུ་རུ། བི་མོ་ཀྵ་བྷུ་ཛེ།
en: Blaze, blaze, O oblation eater!

source: ད་ཧ་ད་ཧ། སརྦ་མ་ལཱ་ན།
en: Flicker, flicker!

source: ཨ་མོ་གྷ་པཱ་ནི་བ་ར་དེ།
en: Your arms grant liberation.

source: ཧཱུཾ་ཧཱུཾ་ནིར་ད་ཧ།
en: Burn, burn all the impurities!

source: པཱ་པཾ།
en: Your hand displays the amogha boon-granting gesture, hūṁ hūṁ!

source: ཤ་མ་ཤ་ནི།
en: Burn all evil!

source: ལོ་ཀོཏྟཱ་ར་ཎི། ས་མནྟ་རཥྨི་བ་ར་དེ།
en: Pacify, O pacifier who saves the world!

source: རུ་ཏུ་རུ་ཏུ།
en: O boon granter, immersed in light, make haste, make haste!

source: པྲ་བ་རེ།
en: Your amogha accomplishment is awesome.

source: ཨ་མོ་གྷ་སིད་དྷི།
en: Oṁ bhūr bhuva!

source: ཨོཾ་བྷུརྦྷུ་པ།
en: Homage to you!

source: དེ་ནི་རྣམ་པར་གྲོལ་བའི་དཀྱིལ་འཁོར་འབར་བ་ཞགས་པ་ཆེན་པོའི་སྙིང་པོ་དང་། གཟུངས་ཀྱི་སྦྱིན་སྲེག་གི་ཆོ་ག་འཇིག་རྟེན་ལས་འདས་པ་བླ་ན་མེད་པ་ཡིན་ནོ།
en: This heart dhāraṇī of Mahāpāśa, the liberating maṇḍala of fire, is the supreme method for performing the supramundane homa.

source: །དེ་ནས་རིག་སྔགས་འཆང་བས་ཐལ་བ་དེས་རྨད་དུ་བྱུང་བ་ཆེན་པོའི་བྱ་བ་ཐམས་ཅད་བྱའོ།
en: The vidyā holder can use the ashes left after this homa to perform any wonderful or miraculous activity.

source: །ཐལ་བ་དེས་གང་གི་ལུས་ལ་བྱུགས་པ་དེ་ནི་སྒྲིབ་པ་དང་སྡིག་པ་ཐམས་ཅད་ལས་གྲོལ་བར་འགྱུར་རོ། །དཔྲལ་བར་ཐིག་ལེ་བྱས་ན་དེ་མ་ཐག་ཏུ་ཞག་བཞི་པའི་རིམས་ལས་ཐར་བར་འགྱུར་རོ། །ཞག་གཉིས་པ་དང་། ཞག་གསུམ་པ་དང་། མཚན་མོ་པ་དང་། ཉིན་པར་པ་དང་།
en: Anyone whose body comes into contact with these ashes will be freed from all their obscurations and cleansed of all evil.

source: ནམ་ཕྱེད་པ་དང་། ཉིན་ཕྱེད་པ་དང་། ལོ་གཅིག་པ་དང་། ཟླ་བ་གཅིག་པ་དང་། ཞག་བདུན་པ་དང་།
en: If he applies the ashes to his forehead as a bindi, he will be instantly cured of a quartan fever, a fever that recurs every two days or every three days, a fever that lasts one day and one night, a fever that recurs every midnight or every midday, or one that recurs annually, monthly, or weekly.

source: རྟག་པའི་རིམས་ལན་འགའ་ཡང་གནས་ཤིང་ཕྱིར་འོང་བར་མི་འགྱུར་རོ། །དཔག་ཚད་བརྒྱ་འདས་ཏེ་འབྲོས་པར་འགྱུར་རོ།
en: He will no longer experience cold fever, as the jvaras will flee as far as one hundred leagues. “

source: །མཚོག་མར་ཐིག་ལེ་བྱས་ན་གདོན་སྟོང་ཕྲག་བརྒྱད་ཅུ་རྩ་བཞི་ལས་ཐར་བར་འགྱུར་རོ། །ཐམས་ཅད་ཀྱང་ཕྱོགས་བཅུར་དཔག་ཚད་སྟོང་དུ་འབྲོས་པར་འགྱུར་རོ།
en: If he marks the top of his head with the bindi, he will be released from all eighty-four thousand grahas; they will flee in the ten directions as far as one thousand leagues.

source: །ཐལ་བའི་རྡུལ་བྱ་རོག་གི་མཆུ་ལ་གོས་པ་ཕྱོགས་ཀྱི་གནས་གང་དུ་ལྷུང་བ་དེར་གནོད་སྦྱིན་དང་། སྲིན་པོ་དང་། འབྱུང་པོ་དང་། ཤ་ཟ་དང་། ཡི་དགས་དང་། གྲུལ་བུམ་དང་། བརྗེད་བྱེད་དང་།
en: If he casts the ashes against the wind, the places where the ashes fall will be free of yakṣas, rākṣasas, bhūtas, piśācas, pretas, kumbhāṇḍas, apasmāras, vighnas, and vināyakas.

source: བགེགས་དང་། ལོག་འདྲེན་ཕྱིར་གནས་པར་མི་འགྱུར་རོ། །ཐམས་ཅད་འབྲོས་སོ། །ཕྱོགས་ཀྱི་གནས་དེར་ལྷུང་ན་སླར་འོང་བར་མི་འགྱུར་རོ།
en: They will all flee and will be unable to return to the same place again.

source: །སྙིང་གར་ཐིག་ལེ་བྱས་ན་ནད་ཐམས་ཅད་ལས་ཐར་བར་འགྱུར་རོ།
en: If he marks his chest with the bindi, all his diseases will disappear.

source: །ལྟེ་བའི་གནས་སུ་ཐིག་ལེ་བྱས་ན་ལྟོ་བའི་ནང་གི་ནད་ཐམས་ཅད་མོད་ལ་སོས་པར་འགྱུར་རོ།
en: If he marks his navel with it, all his abdominal ailments will disappear instantly.

source: །གདུག་པས་ཟིན་པ་ལ་བསྐུས་ན་དུག་མེད་པར་འགྱུར་རོ།
en: If he sprinkles the ashes onto a poisonous bite, the poison will abate.

source: །དུག་གིས་མྱོས་པ་ལ་བྱིན་ན་དུག་མེད་པར་འགྱུར་རོ།
en: If he administers the ashes to someone delirious due to poisoning, the poison will be neutralized. “

source: །ཐལ་བས་ཁྲུས་བྱས་ན་བྱད་དང་། གཡེངས་བྱེད་དང་། སྔགས་དང་། དུག་ཐམས་ཅད་རྣམ་པར་ཞིག་པར་འགྱུར་རོ། །ཤ་བཀྲ་དང་། མཛེ་དང་། འབྲས་དང་།
en: If he bathes in water suffused with the ashes, all kākhordas, kiraṇas, curses, and garas will perish.

source: ཤུ་ཕྲན་མཆེད་པ་དང་། འབྲུམ་བུ་དང་། ལྷོག་པ་དང་། མེ་དབལ་དང་། འབྲུམ་ཕྲན་རྣམས་བྱུང་ན་ཆུ་དྲོན་པོ་དང་སྦྱར་ཏེ་བསྐུས་ལ་མར་ལ་ལན་བདུན་བཟླས་བརྗོད་བྱས་པས་བསྐུས་ན་མོད་ལ་ནད་ཐམས་ཅད་ལས་ཡོངས་སུ་ཐར་བར་འགྱུར་རོ།
en: If he mixes the ashes with warm water and rubs them into skin affected by white leprosy, boils, scabs, abscesses, festering ulcers, or leprous eruptions, and then smears these places with ghee incanted seven times with the mantra, all these diseases will instantly depart.

source: །སྤྲིན་ལོགས་སུ་གཏོར་ན་སད་དང་། སེར་བ་ཐམས་ཅད་མི་འབབ་བོ། །རླུང་ལྡང་བའི་ལོགས་སུ་གཏོར་ན་རླུང་བསྡམས་པར་འགྱུར་རོ། །ཕྱོགས་བཞིར་གཏོར་ན་མཚམས་ཆེན་པོ་བཅད་པར་འགྱུར་རོ། །ཡུལ་འཁོར་ཀུན་ཏུ་གཏོར་ན་མེ་ཏོག་དང་། འབྲས་བུ་དང་། ལོ་ཏོག་དང་། མེ་ཏོག་གི་ལྗོན་ཤིང་དང་།
en: If he casts the ashes in the direction of a rain cloud, this will put a stop to cold waves, wind, and hail.

source: ཤིང་གི་ཡ་ལ་ག་དང་།
en: If he casts the ashes against the wind, the wind will stop.

source: ལྡུམ་ར་དང་། ཀུན་དཀར་ར་བ་དང་། རི་དང་།
en: If he casts the ashes in the four directions, he will create a great protective boundary.

source: རྩྭ་དང་། ཤིང་གེལ་པ་དང་། སྨན་དང་། ནགས་ཚལ་ཐམས་ཅད་ལེགས་པར་བསྲུངས་བར་འགྱུར་རོ། །ཡུལ་འཁོར་ལ་དཔག་ཚད་བརྒྱ་ཚུན་ཅད་ཀུན་ཏུ་མཚམས་ཆེན་པོ་གཅད་པ་བྱས་པར་འགྱུར་རོ།
en: If he sprinkles the ashes around in a circle, all flowers, fruits, crops, flowering trees, vegetable gardens, parks, groves, mountains, grasses, bushes, herbs, and forest trees will be well protected by a great protective circle that will extend as far as one hundred leagues. “

source: །གྲོང་ཁྱེར་གྱི་སྒོ་བཞིར་གཏོར་ན་དེར་འཇུག་པ་དང་། ཕྱིར་འབྱུང་བའི་སེམས་ཅན་བུད་མེད་དང་། སྐྱེས་པ་དང་། ཁྱེའུ་དང་། བུ་མོ་དང་། དགེ་སྦྱོང་དང་། བྲམ་ཟེ་དང་། རྒྱལ་རིགས་དང་། རྗེའུ་རིགས་དང་། དམངས་རིགས་དང་། བྱོལ་སོང་གི་སྐྱེ་གནས་སུ་གཏོགས་པ་རྐང་གཉིས་པ་དང་། རྐང་བཞི་པ་དང་།
en: If he sprinkles the ashes at the four gates of a city, all beings who enter or leave through them—women, men, boys, girls, monks, brahmins, kṣatriyas, vaiśyas, śūdras, two- or four-legged animals, deer, and birds—will be freed from their obscurations and evil.

source: རི་དགས་དང་། བྱ་དེ་དག་ཐམས་ཅད་སྒྲིབ་པ་དང་། སྡིག་པ་དང་བྲལ་བར་འགྱུར་རོ། །དགོངས་པ་ཙམ་གྱིས་ནད་དང་སྡུག་བསྔལ་ཐམས་ཅད་ལས་གྲོལ་བར་འགྱུར་རོ།
en: All their diseases and suffering will disappear as soon as they pass through it.

source: །ནད་ཐམས་ཅད་དང་བྲལ་བར་འགྱུར་རོ།
en: They will be free from disease.

source: །ཚེ་ཡོངས་སུ་བརྗེས་ནས་བདེ་བ་ཅན་གྱི་འཇིག་རྟེན་གྱི་ཁམས་སུ་འགྲོ་ཞིང་། སངས་རྒྱས་ཉིད་དུ་གནས་ཀྱི་བར་དུ་ཕྱིར་མི་ལྡོག་པར་འགྱུར་བའི་གནས་ཐོབ་པར་འགྱུར་རོ།
en: When they take a new birth, it will be in the realm of Sukhāvatī, where they will reach the point from which they cannot regress, and they will remain in Sukhāvatī until buddhahood. “

source: །དུར་ཁྲོད་དམ། ར་བསྲེགས་པའི་སྟེང་དུ་ཐལ་བས་གཏོར་ན། དམྱལ་བར་སྐྱེས་པའི་སེམས་ཅན་དེ་དག་ཐམས་ཅད་མོད་ལ་དམྱལ་བ་ནས་ཐར་ཏེ། མངོན་པར་དགའ་བའམ། བདེ་བ་ཅན་དུ་སྐྱེ་བར་འགྱུར་རོ། །གྲོང་ཁྱེར་རམ། གཙུག་ལག་ཁང་ངམ།
en: If he sprinkles the ashes in a charnel ground, or upon a corpse lying on a funeral pyre, any deceased beings, even those who have fallen into hell, will instantly leave the hell realm and be reborn in the realm of Abhirati or Sukhāvatī.

source: ལྷའི་གནས་སམ། གྲོང་ངམ། ཁྱིམ་མམ། དགོན་པའི་གནས་སམ། ཡུལ་འཁོར་ཀུན་ཏུ་གཏོར་ན་མཚམས་ཆེན་པོ་བཅད་ཅིང་ཞི་བ་ཆེན་པོར་འགྱུར་རོ།
en: If he sprinkles the ashes in a town, a monastery, a temple, a village, a house, or a forest hermitage, he will create a great protective boundary by sprinkling the ashes in a circle around them.

source: །རྒྱལ་པོའི་ཕོ་བྲང་གི་སྒོར་གཏོར་ན་རྒྱལ་པོ་དང་བཙུན་མོའི་འཁོར་དགྲ་ཐམས་ཅད་ལས་ལེགས་པར་བསྲུངས་པར་འགྱུར་རོ།
en: If he sprinkles the ashes at the gate of a royal household, the king and his harem and retinue will be well protected from all enemies.

source: །སྐྱེ་བོ་མང་པོའི་ནང་དུ་གཏོར་ན་སྐྱེ་བོ་མང་པོ་དེ་དག་ཐམས་ཅད་སྒྲིབ་པ་དང་། སྡིག་པ་ཐམས་ཅད་དང་བྲལ་བར་འགྱུར་རོ། །ནད་ཐམས་ཅད་དང་བྲལ་བར་འགྱུར་རོ།
en: If he sprinkles the ashes in the middle of a large crowd, all the people will be purified of obscurations and evil and freed from disease and vice.

source: །གཞན་ཡང་བྱེ་བ་སྟོང་ཕྲག་བརྒྱ་བྱེད་པས་རང་འདོད་པ་ལ་རང་གི་བློས་ཐམས་ཅད་དུ་སྦྱར་བར་བྱའོ།
en: The vidyā holder will be able to perform hundreds of thousands of other activities, but he should always apply his judgement and intelligence. “

source: །དེ་ནས་རྣམ་པར་གྲོལ་བའི་དཀྱིལ་འཁོར་དོན་ཡོད་པའི་ཞགས་པའི་སྙིང་པོ་འཇིག་རྟེན་ལས་འདས་པའི་སྐུ་གཟུགས་རས་ལ་བྲི་བ་བཤད་པར་བྱའོ།
en: I will now teach about a supramundane painting that constitutes a maṇḍala of liberation, the heart essence of Amoghapāśa.

source: །དར་རམ་རས་གཙང་མ་ལེགས་པར་བཏགས་པ་ཚད་ཁྲུ་དོའམ། ཁྲུ་གསུམ་མམ།
en: The vidyā holder should procure a piece of cloth, either cotton or Chinese silk, that is well woven and clean and is two, three, or four cubits in length.

source: ཁྲུ་བཞི་པ་དེའི་དབུས་སུ་དོན་ཡོད་པའི་ཞགས་པ། འཇིག་རྟེན་དབང་ཕྱུག །ཚངས་པའི་ཆ་བྱད་འཆང་བ། དབུ་ལྕང་ལོ་ཅོད་པན་གྱིས་བརྒྱན་པ།
en: In the center, he should draw the lokeśvara Amoghapāśa wearing his garb of Brahmā and with his topknot adorned with a diadem.

source: ཅོད་པན་རྒྱལ་བ་འོད་དཔག་མེད་དང་གཡས་སུ་ཟླ་བ་ཚེས་པ་ཅན་གྱིས་བརྒྱན་པ།
en: On top of the diadem is the victorious Amitābha with the crescent of the new moon to his right.

source: ཕྱག་བཞི་པ། རྒྱན་ཐམས་ཅད་ཀྱིས་བརྒྱན་པ།
en: The four-armed Amoghapāśa is adorned with all the ornaments and sits in a cross-legged posture. “

source: སྐྱིལ་མོ་ཀྲུང་བཅས་ཏེ་བཞུགས་པ་བྲི་བ་ནི་རི་བོ་པོ་ཊ་ལ་ལྕུག་མ་མེ་ཏོག་ཅན་སྣ་ཚོགས་ཀྱིས་གང་བ། རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱི་ལྕུག་མས་གང་བ་བྱའོ།
en: The vidyā holder should draw Potala Mountain covered in various flowers, vines, and jewels.

source: །དེའི་སྟེང་དུ་རྒྱན་ཐམས་ཅད་ཀྱིས་བརྒྱན་པ། སེང་གེའི་ཁྲི་བྱའོ། །སེང་གེའི་ཁྲིའི་སྟེང་དུ་པདྨའི་གདན་བྱའོ།
en: Upon it he should draw a lion throne adorned with all the ornaments, and upon the throne a lotus seat.

source: །དེའི་སྟེང་དུ་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་བཞུགས་པར་བྱ་སྟེ། པདྨ་དང་། མདུང་རྩེ་གསུམ་པ་དང་། ཞགས་པ་ཐོགས་ཤིང་གཟུགས་དེ་ཕྱག་དབུགས་འབྱིན་པ་བྱའོ།
en: The beautifully formed Noble Avalokiteśvara is seated there, holding a lotus, a trident, and a noose and displaying the gesture of giving comfort.

source: །དབུའི་གོང་མན་ཚད་གཞལ་མེད་ཁང་ཆེན་པོ་ལྷ་རྫས་རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱིས་སྤྲས་པ། དབུས་སུ་མཐོ་བ་དང་བཅས་པ་བྱའོ།
en: Above his head is a palatial structure encrusted with various divine jewels and furnished with a terrace.

source: །དབུས་མཐོ་བའི་སྟེང་དུ་དེ་བཞིན་གཤེགས་པ་བདུན་ཚད་དང་མཐུན་པར་པདྨའི་གདན་ལ་བཞུགས་ཤིང་རྒྱན་ཐམས་ཅད་ཀྱིས་བརྒྱན་པའོ། །དེ་བཞིན་གཤེགས་པ་དེའི་གོང་གི་དབུས་སུ་དེ་བཞིན་གཤེགས་པ་རྣམ་པར་སྣང་མཛད་དང་།
en: On that terrace he should draw the seven tathāgatas adorned with all ornaments and sitting on lotus seats, each drawn to scale.

source: འོད་དཔག་མེད་དང་། སྤྱན་རས་གཟིགས་དབང་ཕྱུག་འོད་དང་། དེ་བཞིན་གཤེགས་པ་གསུམ་རྒྱན་ཐམས་ཅད་ཀྱིས་བརྒྱན་པ། སྐྱིལ་མོ་ཀྲུང་བཅས་ཏེ་གཞལ་མེད་ཁང་གི་ནང་ན་བཞུགས་པར་བྱའོ།
en: Above the seven tathāgatas, and inside the palatial structure, he should draw the three tathāgatas Vairocana, Amitābha, and Avalokiteśvara­prabha, each adorned with every ornament and seated in a cross-legged posture. “

source: །འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གི་འོད་འདོམ་གང་ལ་འཁོར་བར་དེ་བཞིན་གཤེགས་པ་སུམ་ཅུ་རྩ་གཉིས་ཀྱིས་བརྒྱན་པར་བྱ།
en: Surrounding Noble Avalokiteśvara, at the distance of one fathom, is a circle of the thirty-two tathāgatas.

source: དེ་བཞིན་གཤེགས་པའི་ཉེ་འཁོར་ཀུན་ཏུ་འོད་ཟེར་འབར་བ་སྣ་ཚོགས་དང་། མདུང་རྩེ་གསུམ་པའི་ཕྲེང་བ་བྱའོ།
en: The circle is filled with multicolored light and has, beyond its circumference, a garland of tridents.

source: །དེ་ཉིད་ཀྱི་ཉེ་འཁོར་དུ་ལྷ་སུམ་ཅུ་རྩ་གཉིས་བྱའོ།
en: The vidyā holder should draw the thirty-two deities surrounding this.

source: །གོང་གི་དབུས་སུ་རྡོ་རྗེ་འཆང་བ་ཁྲོ་གཉེར་ཅན་རྡོ་རྗེ་གསོར་བར་བྱའོ།
en: In the center, at the top, is the wrathful Vajradhara, his face contorted, wielding a vajra.

source: །དེ་ནས་ཚངས་པ་དང་། ཁྱབ་འཇུག་དང་། དབང་ཕྱུག་དང་། དབང་ཕྱུག་ཆེན་པོ་དང་།
en: Next to him are Brahmā, Viṣṇu, and Maheśvara.

source: ལྷའི་དབང་ཕྱུག་ཆེན་པོ་དང་། སུམ་ཅུ་རྩ་གསུམ་གྱི་དབང་པོ་དང་། འོག་མིན་གནས་ཀྱི་ལྷའི་བུ་དང་། དགའ་ལྡན་གྱི་ལྷའི་བུ་དང་། འཕྲུལ་དགའི་ལྷའི་བུ་དང་། ཟླ་བ་དང་། ཉི་མའི་ལྷའི་བུ་དང་། རྒྱལ་པོ་ཆེན་པོ་བཞི་དང་། གཤིན་རྗེ་དང་། ཆུ་ལྷ་དང་། ལུས་ངན་པོ་དང་། གཞོན་ནུ་དང་། མེ་ལྷ་དང་། ནག་པོ་ཆེན་པོ་དང་། དགའ་བའི་དབང་ཕྱུག་དང་། དགའ་བོ་དང་། ཉེ་དགའ་བོ་དང་།
en: Further, there are the divine sons Īśvara, Maheśvara, and Indra, the lord of the realm of Thirty-Three.

source: སྟོབས་ལྷ་དང་། གང་བ་བཟང་པོ་དང་། ནོར་བུ་བཟང་པོ་དང་། གནས་གཙང་མའི་རིགས་ཀྱི་ལྷ་དང་། སུམ་ཅུ་རྩ་གསུམ་པའི་ལྷ་དང་།
en: The vidyā holder should also draw the gods from the realms of Akaniṣṭha, Tuṣita, and Nirmita, the divine sons Candra and Sūrya, the Four Great Kings, Yama, Varuṇa, Kubera, Kumāra, Agni, Mahākāla, Nandikeśvara, Nanda, Upananda, Baladeva, Pūrṇabhadra, Maṇibhadra, the gods from the realms of the Pure Abode and the Heaven of Thirty-Three, and the divine sons from the Paranirmita­vaśavartin heaven. “

source: གཞན་འཕྲུལ་དབང་བྱེད་ཀྱི་ལྷའི་བུ་རྣམས་མེ་ཏོག་སྣ་ཚོགས་དང་།
en: Around the circle of deities, the vidyā holder should draw a ring of lotuses surrounded by vajras and tridents.

source: ནོར་བུ་རིན་པོ་ཆེ་སྣ་ཚོགས་ལག་པ་ནས་འཕྲུལ་པ་དང་། མཚོན་ཆ་སྣ་ཚོགས་ཐོགས་པར་བྱ།། །།འཕགས་པ་དོན་ཡོད་ཞགས་པའི་ཆོ་ག་ཞིབ་མོའི་རྒྱལ་པོ། བམ་པོ་བཅུ་བཞི་པ། ལྷ་རྣམས་ཀྱི་ཕྱི་རོལ་ཐོག་ཐག་ཏུ་པདྨའི་ཕྲེང་བ་རྡོ་རྗེ་དང་།
en: Outside the circle of lotuses, he should draw a circle of outward-pointing hands that hold various flowers, jewels, gems, and other kinds of implements.

source: མདུང་རྩེ་གསུམ་པས་སྤྲས་པའི་པདྨའི་ཕྲེང་བས་ཀུན་ཏུ་འཁོར་བར་བྱ།
en: Outside all this he should paint a halo of light. “

source: གཡས་ཕྱོགས་སུ་འཕགས་མ་སྒྲོལ་མ་སྐྱིལ་མོ་ཀྲུང་ཕྱེད་དུ་བཅས་ཏེ་བཞུགས་པ།
en: To the right of Noble Avalokiteśvara is Noble Tārā, sitting with one leg extended as she gazes up at the face of Noble Avalokiteśvara.

source: ཨུཏྤ་ལ་དང་། ནོར་བུ་རིན་པོ་ཆེ་ཕྱག་ན་ཐོགས་པ། རྒྱན་ཐམས་ཅད་ཀྱིས་བརྒྱན་པ། འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གི་ཞལ་དུ་བལྟ་བར་བྱའོ།
en: She holds a blue lotus and a jewel and is adorned with every ornament.

source: །དེའི་རྒྱབ་བུ་ཁྲོ་གཉེར་མ་མེ་ཏོག་སྣ་ཚོགས་འཆང་བ། རྒྱན་ཐམས་ཅད་ཀྱིས་བརྒྱན་པ་བྱའོ།
en: Behind her is Bhṛkuṭī, holding various flowers and adorned with every ornament.

source: །གཡོན་དུ་དཀར་མོ་ཞེས་བྱ་བ་ནི་སྐྱིལ་མོ་ཀྲུང་ཕྱེད་དུ་བཅས་ཏེ་བཞུགས་པ།
en: To the left of Noble Avalokiteśvara is Śvetā, sitting with one leg extended as she gazes at Noble Avalokiteśvara.

source: ཀུ་མུ་ད་དང་། ནོར་བུ་རིན་པོ་ཆེ་ལག་ན་ཐོགས་པ་རྒྱན་ཐམས་ཅད་ཀྱིས་བརྒྱན་པ། འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་ལ་བལྟ་བར་བྱའོ།
en: She holds in her hands a white water-lily and a jewel, and she is adorned with various ornaments.

source: །དཀར་མོ་དེའི་རྒྱབ་ཏུ་པདྨ་མཛེས་དགའ་མ་མེ་ཏོག་སྣ་ཚོགས་ཐོགས་པ། རྒྱན་ཐམས་ཅད་ཀྱིས་བརྒྱན་པ་བྱའོ། །ལྷ་མོ་སྒྲོལ་མ་དང་།
en: Behind Śvetā is Padmasundarī, holding various flowers and adorned with every ornament.

source: དཀར་མོའི་འོག་ཏུ་ཕ་རོལ་ཏུ་ཕྱིན་པ་བཅུའི་ལྷ་མོ་ཐམས་ཅད་ཀྱང་དབུ་ཡིད་ཙམ་འདུད་པ། ན་བཟའ་དཀར་པོ་གསོལ་བ། རྒྱན་ཐམས་ཅད་ཀྱིས་བརྒྱན་པ་བཞེངས་པ་བྱའོ།
en: Below the goddesses Tārā and Śvetā, the vidyā holder should draw the ten Pāramitās, all of them standing with their head slightly bowed, dressed in white, and adorned with every ornament. “

source: །གཡས་ཕྱོགས་སུ་སྲིན་མོ་རལ་པ་གཅིག་མ་གཏུམ་མོ་སྐྱིལ་མོ་ཀྲུང་ཕྱེད་དུ་བཅས་ཏེ་བཞུགས་པ། ཕྱག་བཞི་ལ་ཞགས་པ་དང་། དགྲ་སྟ་དང་། རལ་གྲི་དང་། རྡོ་རྗེ་ལག་ན་ཐོགས་པ་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་ལ་བལྟ་བར་བྱའོ།
en: To the right, the vidyā holder should draw the fierce rākṣasī Ekajaṭā, who has four arms, sits with one leg extended, holds in her four hands a noose, axe, sword, and vajra, and gazes at Noble Avalokiteśvara. To the left, he should draw Dūtī with fangs protruding from her mouth and adorned with every ornament.

source: །གཡོན་དུ་ཕོ་ཉ་མོ་ཞལ་མཆེ་བ་གཙིགས་པ་རྒྱན་ཐམས་ཅད་ཀྱིས་བརྒྱན་པ་ཕྱག་བཞི་ལ་རྡོ་རྗེ་དང་། དགྲ་སྟ་དང་། ཞགས་པ་དང་། མདུང་རྩེ་གསུམ་པ་ཕྱག་ན་ཐོགས་པ།
en: Four armed, in her four hands she holds a vajra, axe, noose, and trident.

source: སྐྱིལ་མོ་ཀྲུང་ཕྱེད་དུ་བཅས་ཏེ་བཞུགས་པ། འབར་བའི་ནང་ན་འཇིག་རྟེན་དབང་ཕྱུག་ལ་བལྟ་བར་བྱའོ།
en: She sits with one leg extended as she gazes at the Lokeśvara, and she is surrounded by a halo of flames.

source: །རི་བོ་པོ་ཊ་ལའི་ངོས་ཀྱི་གསེབ་ཏུ་ཀླུའི་རྒྱལ་པོ་དགའ་བོ་དང་། ཉེ་དགའ་བོ་དང་། ཀླུའི་བུ་མོ་ཀླུའི་གནས་དང་བཅས་པ་བྱ་སྟེ།
en: Inside Potala Mountain he should draw the nāga kings Nanda and Upananda in their palace, together with nāginīs.

source: མེ་ཏོག་སྣ་ཚོགས་ཐོགས་ཤིང་། གོང་དུ་བཅོམ་ལྡན་འདས་འཇིག་རྟེན་དབང་ཕྱུག་ལ་འཐོར་བར་བྱའོ། །རིའི་སྨད་དུ་ལྷ་མོ་དཔེ་མེད་མ་དང་། ལྷ་མོ་བ་ས་ན་ཏི་དང་། སའི་ལྷ་མོ་དང་། དཔལ་ལྷ་མོ་དང་། ལྷ་མོ་འཇིགས་བྱེད་མ་དང་། སྒྲ་དབྱངས་མ་དང་།
en: They should be depicted casting various kinds of flowers up toward the blessed Lokeśvara. “

source: ལྕགས་སྒྲོག་མ་དང་། དུང་ཅན་མ་སྟེ། རྒྱན་ཐམས་ཅད་ཀྱིས་བརྒྱན་པ། མེ་ཏོག་སྣ་ཚོགས་དང་། ནོར་བུ་རིན་པོ་ཆེ་ཐོགས་པ་བྱའོ།
en: Below Potala Mountain he should draw the goddesses Anaupamyā, Vāsantī, Pṛthivī, Śrī, Bhīmā, Sarasvatī, Saṅkalā, and Śaṅkhinī, each adorned with their respective ornaments and holding various flowers, jewels, and gems.

source: །གཞལ་མེད་ཁང་གི་གོང་དུ་མཆོད་རྟེན་ཆེན་པོ་བརྒྱད་ཕྲེང་བ་སྦྲེངས་ལ་མཆོད་རྟེན་གྱི་རྒྱན་ཇི་ལྟ་བར་བརྒྱན་པར་བྱའོ།
en: Above the palatial structure he should draw the eight great caityas in a straight row, adorned with all the ornaments particular to caityas.

source: །མཆོད་རྟེན་གྱི་འོག་གཡས་རོལ་དུ་བཅོམ་ལྡན་འདས་བྱང་ཆུབ་ཀྱི་སྙིང་པོར་གཤེགས་པ་ལ་འཇིག་རྟེན་དབང་ཕྱུག་མངོན་དུ་མཆོད་པ་མཛད་པ་བྱའོ།
en: On the right side, below the caityas, he should draw the Blessed One approaching the seat of awakening, with the Lokeśvara facing him and making offerings.

source: །འཕགས་པ་རྡོ་རྗེ་འཆང་བ་ཕྱག་ན་རྔ་ཡབ་ཐོགས་པ་བྱའོ།
en: He should also draw Noble Vajradhara with a yak-tail whisk in his hand.

source: །དེའི་འོག་ཏུ་དྲང་སྲོང་དང་། ལྷའི་བུ་མེ་ཏོག་སྣ་ཚོགས་ཀྱིས་བཅོམ་ལྡན་འདས་ལ་མཆོད་པ་བྱའོ།
en: Below them he should draw ṛṣis and devas offering various kinds of flowers to the Blessed One.

source: །གཡོན་ཕྱོགས་སུ་བཅོམ་ལྡན་འདས་ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བ་བྱ་སྟེ། ཀུན་དགའ་བོ་དང་། རྡོ་རྗེ་འཆང་བ་ལག་ན་རྔ་ཡབ་ཀྱིས་བཅོམ་ལྡན་འདས་ལ་མངོན་དུ་གཡོབ་པར་བྱའོ།
en: On the left side, below the caityas, he should draw the Blessed One turning the wheel of Dharma, and Ānanda and Vajradhara with yak-tail whisks in their hands, facing him and fanning him. “

source: །གཡས་ཕྱོགས་སུ་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་དོན་ཡོད་པའི་ཞགས་པ་བཅོམ་ལྡན་འདས་ལ་མཆོད་པ་བྱེད་པ་བྱའོ། །གཡོན་ཕྱོགས་སུ་ཁྲོ་བོའི་རྒྱལ་པོ་བཅོམ་ལྡན་འདས་ལ་མཆོད་པ་བྱེད་པ་བྱའོ།
en: To the right, the vidyā holder should draw Noble Avalokiteśvara-Amoghapāśa worshiping the Blessed One, and to the left, Krodharāja worshiping the Blessed One.

source: །དེའི་འོག་ཏུ་དྲང་སྲོང་དང་། ལྷའི་ཚོགས་བཅོམ་ལྡན་འདས་ལ་མཆོད་པ་བྱེད་པ་བྱའོ།
en: Below each of them are hosts of ṛṣis and devas worshiping the respective Blessed One.

source: །རས་ཀྱི་སྐུ་གཟུགས་ཀྱི་གཡོན་དང་གཡས་ཀྱི་ཕྱི་རོལ་ཐོག་བྲག་ཏུ་དེ་བཞིན་གཤེགས་པའི་སྐུ་གཟུགས་བརྒྱ་རྩ་བརྒྱད་པདྨོའི་གདན་ལ་ཚད་ཇི་བཞིན་དུ་སྐྱིལ་མོ་ཀྲུང་བཅས་ཏེ་བཞུགས་པ་རྒྱན་ཐམས་ཅད་ཀྱིས་བརྒྱན་པར་བྱའོ།
en: On the left and right margins of the canvas he should draw to scale the figures of one hundred and eight tathāgatas, each sitting in a cross-legged posture upon lotus seats and adorned with all ornaments.

source: །འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གི་སེང་གེའི་གདན་གྱི་ཞབས་དྲུང་དུ་རིག་སྔགས་འཆང་བ་པུས་མོ་བཙུགས་ཏེ། མེ་ཏོག་དང་། པོག་ཕོར་དང་། བགྲང་ཕྲེང་ལག་ན་ཐོགས་ཏེ་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་ལ་མངོན་དུ་བལྟ་བར་བྱའོ།
en: He should draw himself at the base of the lotus that supports the lion throne of Noble Avalokiteśvara, kneeling down and facing Noble Avalokiteśvara, with flowers, an incense holder, and a rosary in his hands. “

source: །རི་མོ་མཁན་ཁྲུས་བྱས་ཤིང་གོས་གཙང་མ་བགོས་ཏེ། གཙང་བར་བྱས་ལ་རོ་སྣ་ཚོགས་པའི་ཟས་དཀར་གསུམ་བཟའ་བར་བྱའོ།
en: He should maintain ritual purity, bathe thoroughly, wear clean clothes, and subsist on the three ‘white’ foods prepared in various flavors.

source: །སྣོད་སར་པ་གཙང་མའི་ནང་ནས་ཚོན་ལྷག་མ་མ་ཡིན་པས་བྲི་བར་བྱའོ།
en: He should execute the painting using uncontaminated paints kept in clean containers.

source: །འདིའང་ཁ་ཟས་མི་གཙང་བ་སྣ་ཚོགས་དང་། གོས་ངན་པ་མི་གཙང་བ་ཡོངས་སུ་སྤང་བར་བྱའོ། །ཚིག་ངན་པ་དང་། སེམས་ངན་པ་ཡོངས་སུ་སྤང་བར་བྱའོ། །ཆང་དང་། ཤ་དང་། བེག་བཙོང་དང་།
en: He should avoid inappropriate foods and inappropriate clothing; in particular he should avoid wine, meat, onions, garlic, red onions, or any combinations thereof.

source: སྒོག་སྐྱ་དང་། ཀེའུ་དང་འདྲེས་པ་ཡོངས་སུ་སྤང་བར་བྱའོ། །ཉི་མ་རེ་རེ་ཞིང་བའི་རྣམ་ལྔ་ལ་རེག་པར་བྱའོ། །དྲི་མ་དང་བྲལ་ཞིང་སེར་སྣ་དང་། ཕྲག་དོག་དང་བྲལ་བར་བྱའོ།
en: He should sprinkle himself, every day, with the five products of the cow, and he should be free from the defilements and envy and jealousy.

source: །བྱམས་པ་དང་། སྙིང་རྗེའི་ལྷག་པའི་བསམ་པ་དང་། དཀོན་མཆོག་གསུམ་ལ་དང་བ་ལྷག་པར་བྱ་སྟེ་རས་ཀྱི་སྐུ་གཟུགས་བྲི་བར་བྱའོ།
en: Instead, he should cultivate loving kindness and compassion and, above all, have faith in the Three Jewels. “

source: །ག་པུར་དང་། གླ་རྩིས་བསྒོས་པའི་ཚོན་སྣ་ཚོགས་ཀྱིས་བྲི་བར་བྱའོ།
en: He should execute the painting on canvas of fine cotton using paints of various colors perfumed with camphor and musk.

source: །དབེན་ཞིང་འདུ་འཛི་ཡོངས་སུ་སྤང་བར་བྱའོ། །རྨུགས་པ་དང་། གཉིད་ཡོངས་སུ་སྤང་བར་བྱའོ།
en: He should be undistracted, avoid crowds, and be free from sloth and apathy.

source: །དེ་ལྟར་རི་མོ་བྲི་བ་ནི་ལས་ལེགས་པར་བྱས་པ་ཡིན་ནོ།
en: If he paints in this way his work will turn out well.

source: །ཟླ་བ་ཡར་གྱི་ངོ་ལ་བྲི་བར་བྱའོ། །རྒྱུ་སྐར་ཤིན་ཏུ་བཀྲ་ཤིས་པ་དང་། ཚེས་གྲངས་དང་ཉི་མ་ཤིན་ཏུ་བཀྲ་ཤིས་པ་ལ་བརྩམ་པར་བྱའོ། །རྒྱུ་སྐར་རྒྱལ་ནི་བཀྲ་ཤིས་པ་ཡིན་ཏེ་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱིས་བསྔགས་པ། བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱིས་བྱིན་གྱིས་བརླབས་པ།
en: He should not begin painting during the dark fortnight but rather the bright fortnight when the stars are auspicious, specifically on the auspicious lunar day during the lunar asterism of Puṣya, which is praised by all the tathāgatas and blessed by all the bodhisattvas.

source: ལྷ་ཐམས་ཅད་ཀྱིས་རྗེས་སུ་བཟུང་བ་ཡིན་ནོ། །རིགས་ཀྱི་བུ་དང་། རིགས་ཀྱི་བུ་མོ་དང་། དགེ་སློང་དང་། དགེ་སློང་མ་དང་། དགེ་བསྙེན་དང་། དགེ་བསྙེན་མ་དང་། དགེ་སྦྱོང་དང་། བྲམ་ཟེ་དང་། རྒྱལ་རིགས་དང་། རྗེའུ་རིགས་དང་། དམངས་རིགས་དང་། བུད་མེད་དང་། སྐྱེས་པ་དང་། ཁྱེའུ་དང་།
en: All the deities will then be favorably disposed. “

source: བུ་མོ་གང་ལ་ལ་ཞིག་དོན་ཡོད་པའི་ཞགས་པའི་སྙིང་པོ་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱིས་ཕྱག་བྱས་པ། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་རྣམ་པར་གཟིགས་པ། བྱང་ཆུབ་ཆེན་པོའི་དཀྱིལ་འཁོར་གསང་བ། རྣམ་པར་གྲོལ་བའི་དཀྱིལ་འཁོར་གསང་བ། རས་ཀྱི་སྐུ་གཟུགས་ཆེན་པོ་མཐོང་བ་ནི་སྐུ་གཟུགས་མཐོང་བ་ཙམ་གྱི་མོད་ལ་སྡིག་པ་དང་སྒྲིབ་པ་ཐམས་ཅད་ལས་རྣམ་པར་གྲོལ་བར་འགྱུར་རོ། །མཚམས་མེད་པ་ལྔ་བྱེད་པ་དང་། མཚམས་མེད་པ་ལ་གཞོལ་བ་དང་། དམ་པའི་ཆོས་ཡོངས་སུ་སྤོང་བ་དང་།
en: Any son or daughter of good family, monk or nun, male or female lay practitioner, or ascetic, any brahmin, kṣatriya, vaiśya, or śūdra, and any woman, man, boy, or girl who sees this great cloth painting—the heart essence of Amoghapāśa, honored by all bodhisattvas, consecrated by the gaze of all tathāgatas, the great secret maṇḍala of awakening, the great secret maṇḍala of liberation—will be purged of all their negativity and obscurations as soon as they see it.

source: འཕགས་པ་ལ་སྐུར་པ་འདེབས་པ་དང་། སངས་རྒྱས་དང་། བྱང་ཆུབ་སེམས་དཔའ་དང་། ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཐམས་ཅད་སྤོང་བར་བྱེད་པ་རྣམས་ཀྱང་མཐོང་བ་ཙམ་ལ་སོགས་པས་སྡིག་པ་ཐམས་ཅད་ཕྱེ་མར་རློག་གོ།
en: Even those who have committed the five acts of immediate retribution and are destined for rebirth in the Avīci hell, those who reject the Dharma or revile the noble ones, and those who reject all the buddhas, bodhisattvas, śrāvakas, and pratyekabuddhas will eliminate all their evil and be liberated.

source: །རྣམ་པར་གྲོལ་བར་འགྱུར་རོ། །སྡོམ་པ་ཆེན་པོ་ཡང་དག་པར་འཛིན་པར་འགྱུར་རོ།
en: They will develop great moral restraint. “
